#include <stdio.h> 

int main(){ // main function จุดเริ่มต้นการทำงานของโปรแกรม
    float scores[3][3]; //ประกาศตัวเเปร scores เป็นarray 2 มิติ ขนาด 3เเถว 3คอลัมน์ 
    char *subjects[3] = {"Math", "Physics", "Chemistry"}; // ประกาศตัวเเปร subjects เป็น arrray เก็บชื่อ 3วิชา
    int i, j; // ประกาศตัวเเปร i เเละ j เป็นจำนวนเต็ม
    for (i = 0; i < 3; i++){  //ลูปสำหรับรับข้อมูลนร 3คน ลูปนอก i จะเลือกนักเรียนทีละคน ลูปใน  j จะรับคะเเนนวิชา
        printf("Enter scores for student %d: \n", i + 1); //เเสดงข้อความบอกว่ากำลังกรอกคะเเนนของนักเรียนคนที่เท่าไหร่
        for (j = 0; j < 3; j++){ //ลูปสำหรับรับคะเเนน 3วิชา
            printf("%s: ", subjects[j]); //เเสดงข้อความบอกว่ากำลังกรอกคะเเนนวิชาอะไร
            scanf("%f", &scores[i][j]); //รับคะเเนนเเล้วเก็บใน array 2 มิติ
        }
        printf("\n"); //ขึ้นบรรทัดใหม่
    }
    printf("Score table: \n"); //เเสดงหัวตาราง
    printf("Math\tPhysics\tChemistry\n");
    for (i = 0; i < 3; i++){  //ลูปสำหรับรัน3 ครั้ง ถ้าเกิน3 จะจบลูป
        printf("Student %d: ", i + 1); //เเสดงข้อความบอกว่าเป็นเเถวคนที่เท่าไหร่ ใช้ i+1 เพื่อให้นักเรียนเริ่มจาก 1 ไม่ใช่ 0
        for (j = 0; j < 3; j++){ //ลูปสำหรับเเสดงคะเเนนของวิชา
            printf("%7.2f ", scores[i][j]); //เเสดงคะเเนนโดยปัดเศษทศนิยม 2 ตำแหน่งเเละจัดช่องกว่าง 7
        }
        printf("\n");
    }
    printf("\nAverage per subject:\n"); //เเสดงข้อความบอกค่าเฉลี่ยของเเต่ละวิชา
    for (j = 0; j < 3; j++){  //ลูปสำหรับรัน3 ครั้ง ถ้าเกิน3 จะจบลูป
        float sum =0;   //ประกาศตัวเเปร sum เป็นทศนิยมเพื่อเก็บผลรวมของคะเเนน
        for (i = 0; i < 3; i++){   //ลูปสำหรับบวกคะเเนนของนักเรียน 3คน
            sum += scores[i][j]; //บวกคะเเนนของนักเรียนคนที่ i วิชา j เข้ากับผลรวม
        }
        printf("%s: %.2f\n", subjects[j],sum / 3); //หาค่าเฉลี่ย
    }
    return 0; //จบการทำงานของโปรเเกรม
}